---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RgbGParam
source: html/661fe76a-5383-092a-80bb-daef376b6c5b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RgbGParam Property

"Green value for RGB color spec. (for Use with XAML Data Template example)"

## Syntax (C#)
```csharp
public static ForgeTypeId RgbGParam { get; }
```